In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [7]:
#1)
r=[4,8,15,16,23,43]
df=pd.Series(r,index=None)

In [8]:
df

0     4
1     8
2    15
3    16
4    23
5    43
dtype: int64

In [13]:
type(df)

pandas.core.series.Series

In [17]:
#2)
l=[12,13,"jeeban","jyoti",{"age":"20","height":"6 ft"},"Data science",(23,4),["data","science"],"web","dev"]

In [18]:
df=pd.Series(l)

In [19]:
df

0                                 12
1                                 13
2                             jeeban
3                              jyoti
4    {'age': '20', 'height': '6 ft'}
5                       Data science
6                            (23, 4)
7                    [data, science]
8                                web
9                                dev
dtype: object

In [28]:
#3)
import pandas as pd
table=[["Alice",25,"female"],["Bob",30,"Male"],["Claire",27,"female"]]
df=pd.DataFrame(table,index=["Name","Age","Gender"])

In [29]:
df

             0   1       2
Name     Alice  25  female
Age        Bob  30    Male
Gender  Claire  27  female

In [30]:
"""
4)A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
panda.series:-it is One-dimensional,Homogenous – Series elements must be of the same data type.,Size-immutable – Once created, the size of a Series object cannot be changed.
-->#pandas.Series
series = pd.Series(data=None, index=None, dtype=None, name=None)
-->#pandas.DataFrame
df = pd.DataFrame(data=None, index=None, columns=None, dtype=None)
"""

'\n4)A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.\npanda.series:-it is One-dimensional,Homogenous – Series elements must be of the same data type.,Size-immutable – Once created, the size of a Series object cannot be changed.\n-->#pandas.Series\nseries = pd.Series(data=None, index=None, dtype=None, name=None)\n-->#pandas.DataFrame\ndf = pd.DataFrame(data=None, index=None, columns=None, dtype=None)\n'

In [36]:
#Creating a DataFrame 
data = {
    "Class 1": [22, 33, 38],
    "Class 2": [45, 28, 36], 
    "Class 3": [32, 41, 47]
}
df = pd.DataFrame(data=data, index=['math avg', 'science avg', 'english avg'])

In [37]:
df

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

In [38]:
#creating a series
data = {'Mon': 22, 'Tues': 23, 'Wed': 23, 'Thurs': 24, 'Fri': 23, 'Sat': 22, 'Sun': 21}
series = pd.Series(data=data)

In [39]:
series

Mon      22
Tues     23
Wed      23
Thurs    24
Fri      23
Sat      22
Sun      21
dtype: int64

In [40]:
"""
5)
commonly used functions in pandas:-
1)pd.read_csv, pd.read_excel
2) df.columns
3)df.drop()
4).len()
5) df.query()
6) df.iloc()
7)df.loc()
8)df[‘’].dtypes
9)df.select_dtypes()
10)df.insert()
"""

'\n5)\ncommonly used functions in pandas:-\n1)pd.read_csv, pd.read_excel\n2) df.columns\n3)df.drop()\n4).len()\n5) df.query()\n6) df.iloc()\n7)df.loc()\n8)df[‘’].dtypes\n9)df.select_dtypes()\n10)df.insert()\n'

In [41]:
#example:-
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [42]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [43]:
#6)series and panel are mutable in nature

In [50]:
#7
data = {'index': [('a', 'b'), ('a', 'c')],
        'columns': [('x', 1), ('y', 2)],
        'data': [[1, 3], [2, 4]],
        'index_names': ['n1', 'n2'],
        'column_names': ['z1', 'z2']}
df=pd.DataFrame(data,columns=None)

In [51]:
df

    index columns    data index_names column_names
0  (a, b)  (x, 1)  [1, 3]          n1           z1
1  (a, c)  (y, 2)  [2, 4]          n2           z2